package chapter9;
//created : 2024-01-9
//updated : 2024-01-10
public class Method_02 {

	public static void main(String[] args) {
		/*
		 * 메서드 사용의 장점
		 * 1. 코드 반복을 줄일 수 있음.
		 * 대부분의 프로그램은 어떤 코드를 반복해서 사용.
		 * 반복되는 코드를 방치하면 유지보수하는 사람은 반복되는 코드로 불편을 느끼게 되고,
		 * 코드가 반복되면 기억하기에 불편을 느끼게 됨.
		 * 
		 * 또 코드를 개선하거나 유지보수할 때 여러 부분을 수정해야 하는 문제가 발생.
		 * Don't repeat yourself (DRYY, 반복하지 마라)
		 * 원칙을 지키는 대표적인 방법이 바로 '메서드를 활용하는 것'
		 * 
		 * 2. 더 높은 추상화를 할 수 있다.
		 * 내가 만들거나 남이 만든 프로그램을 읽을 경우
		 * 내부에 있는코드를 하나하나 읽을 경우 프로그램을 빨리, 제대로 파악하기 어려움.
		 * 메서드를 활용하면 세부 코드를 하나하나 신경 쓰지 않아도, '메서드 이름'만 봐도 유추할 수 있음.
		 */
		
		//프로그램에서 get = 어디서 갖고와라 라는 뜻으로 자주쓰임 . 메서드 이름
	}

}
