package chapter_19_InnerClass.innerClass00;

class A {
    // 인스턴스 멤버 클래스(B)
    class B {
    }

    // 인스턴스 필드 값으로 B 객체 대입
    B field = new B();

    // 생성자
    public A() {
        B b = new B(); // 생성자와 메소드에서 내부 클래스 B의 객체를 생성하는 예시
    }

    // 인스턴스 메소드
    void method() {
        B b = new B();
    }
}

public class InnerClass00 {
    public static void main(String[] args) {

        // A 객체 생성
        A a = new A();

        // B 객체 생성
        A.B b = a.new B();
    }
}

/*
 * 클래스 A 안에 내부 클래스 B가 정의되어 있다.
 * 내부 클래스 B는 A 클래스의 인스턴스 멤버 클래스 입니다.
 *
 * 내부 클래스 B
 * 정의: 내부 클래스 B는 클래스 A의 인스턴스 멤버로, A 클래스 안에 정의되어 있습니다.
 * 사용:
 * 클래스 A의 인스턴스 필드로 사용됩니다.
 * 클래스 A의 생성자와 메소드에서도 객체로 생성됩니다.
 *
 * 외부 클래스 A
 * 필드: B 타입의 인스턴스 필드 field가 있습니다.
 * 생성자: 생성자 안에서 B 클래스의 객체를 생성합니다.
 * 메소드: 인스턴스 메소드 안에서도 B 클래스의 객체를 생성합니다.
 *
 * 내부 클래스는 주로 외부 클래스와 강하게 결합된 상황에서 사용되며,
 * 외부 클래스의 멤버들에 쉽게 접근하고 활용할 수 있도록 설계됩니다.
 */