package chapter_5_loop;

/**
 * 이 클래스는 반복문에서 `continue` 문을 사용하는 방법을 보여줍니다.
 * `continue` 문은 반복문의 현재 반복을 건너뛰고 다음 반복으로 진행합니다.
 * 이는 반복문 내에서 특정 조건을 건너뛰고 싶을 때 유용하게 사용할 수 있습니다.
 * <p>
 * - `break` : 반복문을 즉시 종료합니다.
 * - `continue` : 현재 반복의 나머지 부분을 건너뛰고 다음 반복으로 이동합니다.
 * <p>
 * 이 예제에서는 `continue` 문을 사용하여 1부터 100까지의 홀수의 합을 계산합니다.
 * ===========================================================
 * 날짜           : 2024-01-24
 */
public class Continue_01 {
    public static void main(String[] args) {
        /*
         * 이 예제는 continue 문을 사용하여 1부터 100까지의 홀수만 합산합니다.
         * 숫자가 짝수일 때, continue 문이 실행되어 반복문의 나머지 부분을 건너뜁니다.
         */
        int total = 0;
        int num;

        for (num = 1; num <= 100; num++) {
            if (num % 2 == 0) {
                continue; // 짝수인 경우 반복문의 나머지 부분을 건너뜁니다.
            }
            total += num; // 이 문장은 홀수인 경우에만 실행됩니다.
        }
        System.out.println("1부터 100까지의 홀수의 합은 " + total + "입니다.");
    }
}
